ЭкзаменационнаяЗадача/src/Documents/ПеремещениеКниг/ПеремещениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеКниг</name>
  <registerRecords>AccumulationRegister.ОстаткиНомеклатуры</registerRecords>
  <registerRecords>AccumulationRegister.БронированиеТоваров</registerRecords>
  <attributes>
    <name>СкладОтправки</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПриема</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПеремещаемыхКниг</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/AccumulationRegisters/ОстаткиНомеклатуры/ОстаткиНомеклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНомеклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЭкзаменационнаяЗадача/src/Documents/ПеремещениеКниг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиНомеклатуры Приход
	Движения.ОстаткиНомеклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПеремещаемыхКниг Из СписокПеремещаемыхКниг Цикл
		Движение = Движения.ОстаткиНомеклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = СкладПриема;
		Движение.Книга = ТекСтрокаСписокПеремещаемыхКниг.Книга;
		Движение.Количество = ТекСтрокаСписокПеремещаемыхКниг.Количество;
	КонецЦикла;

	// регистр ОстаткиНомеклатуры Расход
	Движения.ОстаткиНомеклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПеремещаемыхКниг Из СписокПеремещаемыхКниг Цикл
		Движение = Движения.ОстаткиНомеклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладОтправки;
		Движение.Книга = ТекСтрокаСписокПеремещаемыхКниг.Книга;
		Движение.Количество = ТекСтрокаСписокПеремещаемыхКниг.Количество;
	КонецЦикла;

КонецПроцедуры
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
